Repository: Maqcel/Flu_10xCards
Catalog: lib/l10n/arb/app_*.arb
Languages: pl

# appFailureNetwork
source: Network error. Please check your connection.
pl: Błąd sieci. Sprawdź połączenie z internetem.

# appFailureServer
source: Server error. Please try again later.
pl: Błąd serwera. Spróbuj ponownie później.

# appFailureValidation
source: Invalid data provided.
pl: Nieprawidłowe dane.

# appFailureUnauthorized
source: You are not authorized to perform this action.
pl: Nie masz uprawnień do wykonania tej akcji.

# appFailureNotFound
source: Requested resource not found.
pl: Nie znaleziono żądanego zasobu.

# appFailureCache
source: Failed to load cached data.
pl: Nie udało się załadować danych z pamięci podręcznej.

# appFailureUnexpected
source: An unexpected error occurred.
pl: Wystąpił nieoczekiwany błąd.

# appFailureAiRateLimitExceeded
source: AI rate limit exceeded. Please try again later.
pl: Przekroczono limit zapytań AI. Spróbuj ponownie później.

# appFailureAiInsufficientCredits
source: Insufficient AI credits. Please check your account.
pl: Niewystarczające środki AI. Sprawdź swoje konto.

# appFailureAiModelUnavailable
source: AI model '{model}' is currently unavailable.
pl: Model AI '{model}' jest obecnie niedostępny.

# appFailureAiInvalidResponse
source: Invalid response from AI. Please try again.
pl: Nieprawidłowa odpowiedź z AI. Spróbuj ponownie.

# appFailureAiTimeout
source: AI request timed out. Please try again.
pl: Zapytanie AI przekroczyło limit czasu. Spróbuj ponownie.

# counterAppBarTitle
source: Counter
pl: Licznik

# dashboardTitle
source: Dashboard
pl: Pulpit

# learnTitle
source: Learn
pl: Nauka

# statsTitle
source: Statistics
pl: Statystyki

# settingsTitle
source: Settings
pl: Ustawienia

# generationTitle
source: Generate Flashcards
pl: Generuj fiszki

# generationInputHint
source: Paste your text here (1,000 - 10,000 characters)
pl: Wklej tutaj swój tekst (1 000 - 10 000 znaków)

# generationCharCounter
source: {current} / 10,000 characters
pl: {current} / 10 000 znaków

# generationMinChars
source: Minimum 1,000 characters required
pl: Wymagane minimum 1 000 znaków

# generationGenerateButton
source: Generate Flashcards
pl: Generuj fiszki

# generationLoading
source: Generating flashcards...
pl: Generowanie fiszek...

# generationErrorValidation
source: Text must be between 1,000 and 10,000 characters
pl: Tekst musi zawierać od 1 000 do 10 000 znaków

# generationErrorUnexpected
source: Failed to generate flashcards. Please try again.
pl: Nie udało się wygenerować fiszek. Spróbuj ponownie.

# generationSuccessSaved
source: {count} flashcards saved!
pl: Zapisano {count} fiszek!

# generationAllReviewed
source: All proposals reviewed!
pl: Przejrzano wszystkie propozycje!

# generationCounterAccepted
source: Accepted
pl: Zaakceptowane

# generationCounterEdited
source: Edited
pl: Edytowane

# generationCounterRemaining
source: Remaining
pl: Pozostałe

# generationCardFrontLabel
source: Front side (tap to flip)
pl: Przód (kliknij aby odwrócić)

# generationCardBackLabel
source: Back side
pl: Tył

# generationButtonCancel
source: Cancel
pl: Anuluj

# generationButtonSave
source: Save ({count})
pl: Zapisz ({count})

# generationEditDialogTitle
source: Edit Flashcard
pl: Edytuj fiszkę

# generationEditDialogFrontLabel
source: Front
pl: Przód

# generationEditDialogBackLabel
source: Back
pl: Tył

# generationEditDialogCancel
source: Cancel
pl: Anuluj

# generationEditDialogSave
source: Save
pl: Zapisz
